vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA256_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MCXA256_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MCXA256</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MCXA256" Dvendor="NXP:11">
      <debugconfig default="swd" clock="5000000" swj="true"/>
      <sequences>
        <sequence name="EnableTraceClk">
          <block>
            __var SYSCON_NS_Base_Addr = 0x40091000;
            __var TRACECLKSEL_Addr    = SYSCON_NS_Base_Addr + 0x190;
            __var TRACECLKDIV_Addr    = SYSCON_NS_Base_Addr + 0x194;
            __var AHBCLKCTRLSET1_Addr = SYSCON_NS_Base_Addr + 0x54;
            __var clksel              = 0;
            __var clkdiv              = 0;
          </block>
          <control if="__traceout &amp; 0x3">
            <block>clksel = Read32(TRACECLKSEL_Addr);  // Read current TRACECLKSEL value</block>
            <control if="clksel &gt; 2" info="Trace (TPIU) Clock not selected?">
              <block>Write32(TRACECLKSEL_Addr, 0x0);   // Select Trace divided clock</block>
            </control>
            <block>
              clkdiv = (Read32(TRACECLKDIV_Addr) &amp; 0xFF);  // Read current TRACECLKDIV value, preserve divider but clear rest to enable
              Write32(TRACECLKDIV_Addr, clkdiv);
              
              Write32(AHBCLKCTRLSET1_Addr, (1 &lt;&lt; 7));   // Enable Port0 clock
            </block>
          </control>
        </sequence>
        <sequence name="EnableDebugMailbox">
          <block/>
          <control if="!(ReadAP(0x0) &amp; 0x40)">
            <!-- Check AHB-AP CSW DbgStatus to decide if need enable DebugMailbox -->
            <block>
              __var status=0x55aa;
              Message(0, "MCX connect script start");
              
              // Read APIDR
              __dp = 0;
              __ap = 1;
              status = ReadAP(0xFC);
              Message(0, "APIDR: 0x%08X", status);
              
              // Read DPIDR
              __dp = 0;
              __ap = 1;
              status = ReadDP(0x0);
              Message(0, "DPIDR: 0x%08X", status);
              
              // Active DebugMailbox
              __dp = 0;
              __ap = 1;
              WriteAP(0x0, 0x00000021);
              DAP_Delay(30000);
              ReadAP(0x0);
              
              // Enter Debug Session
              __dp = 0;
              __ap = 1;
              WriteAP(0x4, 0x00000007);
              DAP_Delay(30000);
              ReadAP(0x8);
              
              __dp = 0;
              __ap = 0;
              
              Message(0, "MCX connect script end");
            </block>
          </control>
        </sequence>
        <sequence name="DebugPortStart">
          <block>
            __var SW_DP_ABORT  = 0x0;
            __var DP_CTRL_STAT = 0x4;
            __var DP_SELECT    = 0x8;
            __var powered_down = 0;
            // Switch to DP Register Bank 0
            WriteDP(DP_SELECT, 0x00000000);
            
            // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
            powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
          </block>
          <control if="powered_down">
            <block>
              // Request Debug/System Power-Up
              WriteDP(DP_CTRL_STAT, 0x50000000);
            </block>
            <!-- Wait for Power-Up Request to be acknowledged -->
            <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
            <!-- JTAG Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 1">
              <block>
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                WriteDP(DP_CTRL_STAT, 0x50000F32);
                
                Sequence("EnableDebugMailbox");
              </block>
            </control>
            <!-- SWD Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 2">
              <block>
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                WriteDP(DP_CTRL_STAT, 0x50000F00);
                
                // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                WriteDP(SW_DP_ABORT, 0x0000001E);
                
                Sequence("EnableDebugMailbox");
              </block>
            </control>
          </control>
        </sequence>
        <sequence name="WaitForStopAfterReset">
          <block>
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            __var DFSR_Addr  = SCS_Addr + 0xD30;
            DAP_Delay(100000);  // Give bootloader time to do what it needs to do
            Sequence("EnableDebugMailbox");
            Write32(DHCSR_Addr, 0xA05F0003);  // Halt the core in case it didn't stop at a breakpiont.
            // Clear watch point
            Write32(0xE0001020, 0x0);
            Write32(0xE0001028, 0x0);
            Write32(0xE0001030, 0x0);
            Write32(0xE0001038, 0x0);
            
            // Clear XPSR to avoid undefined instruction fault caused by IT/ICI
            Write32(0xE000EDF8, 0x01000000);
            Write32(0xE000EDF4, 0x00010010);
            // Set MSPLIM to 0
            Write32(0xE000EDF8, 0x00000000);
            Write32(0xE000EDF4, 0x0001001C);
          </block>
          <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
          <control if="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0">
            <block>
              Write32(DHCSR_Addr, 0xA05F0003);  // Force halt until finding a proper catch. Probably works better from flash.
            </block>
          </control>
        </sequence>
        <sequence name="ResetHardware">
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            __var DEMCR_Addr  = SCS_Addr + 0xDFC;
            __var tmp;
            
            //Halt the core
            Write32(DHCSR_Addr, 0xA05F0003);
            //clear VECTOR CATCH and set TRCENA
            tmp = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, tmp | 0x1000000);
            __errorcontrol = 1;
            
            //// // Set watch point at SYSCON_BASE + 0x40 access
            //// Write32(0xE0001020, 0x4009123C);
            //// Write32(0xE0001028, 0x00000814);
            
