vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA256_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_hmac" Cversion="1.0.0" condition="component.sgi_pkc.hmac.condition_id">
      <description>Component sgi_pkc.hmac</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Cleanup.c" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Functions.c" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Helper.c" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_KeyTypes.c" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Modes.c" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Sw.c" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClHmac/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac.h" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_KeyTypes.h" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Core_Functions_Sw.h" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Memory.h" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClHmac/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_key" Cversion="1.0.0" condition="component.sgi_pkc.key.condition_id">
      <description>Component sgi_pkc.key</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClKey/src/mcuxClKey.c" projectpath="component/sgi_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClKey/src/mcuxClKey_agreement.c" projectpath="component/sgi_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClKey/src/mcuxClKey_Encoding.c" projectpath="component/sgi_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClKey/src/mcuxClKey_generate_keypair.c" projectpath="component/sgi_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClKey/src/mcuxClKey_Validation.c" projectpath="component/sgi_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClKey/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClKey/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/mcuxClKey.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/mcuxClKey_EncodingMechanisms.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Constants_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Functions_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Internal_EncodingMechanisms.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Types_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClKey/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClKey/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_mac" Cversion="1.0.0" condition="component.sgi_pkc.mac.condition_id">
      <description>Component sgi_pkc.mac</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMac/src/mcuxClMac.c" projectpath="component/sgi_pkc/src/comps/mcuxClMac/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMac/inc/mcuxClMac.h" projectpath="component/sgi_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Ctx.h" projectpath="component/sgi_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClMac/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClMac/inc/internal/"/>
      </files>
    </component>
