vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA256_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_memory" Cversion="1.0.0" condition="component.sgi_pkc.memory.condition_id">
      <description>Component sgi_pkc.memory</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMemory/src/mcuxClMemory.c" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory_Clear.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory_Copy.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory_Copy_Reversed.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory_Endianness.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory_Set.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/mcuxClMemory_Xor.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_Clear_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_ClearSecure_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_Compare_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_CompareDPASecure_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_CompareRev_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_CompareSecure_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_Copy_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_CopySecure_Reversed_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_CopySecure_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_Copy_Reversed_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_CopySecurePow2_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_CopyWords_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_Set_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_SetSecure_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_XOR_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_XORSecure_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/mcuxClMemory_XORSecureWithConst_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMemory/inc/internal"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/mcuxCsslMemory_Clear.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/mcuxCsslMemory_Compare.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/mcuxCsslMemory_Copy.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/mcuxCsslMemory_Internal_SecureSet.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/mcuxCsslMemory_Internal_XOR.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/mcuxCsslMemory_SecureSet.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/mcuxCsslMemory_Set.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/asm/mcuxCsslMemory_Compare_arm_asm.S" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src/asm"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/asm/mcuxCsslMemory_CompareRev_arm_asm.S" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src/asm"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/asm/mcuxCsslMemory_Internal_Copy_arm_asm.S" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src/asm"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/asm/mcuxCsslMemory_Internal_CopyRev_arm_asm.S" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src/asm"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxCsslMemory/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/mcuxCsslMemory.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/mcuxCsslMemory_Clear.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/mcuxCsslMemory_Compare.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/mcuxCsslMemory_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/mcuxCsslMemory_Copy.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/mcuxCsslMemory_SecureSet.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/mcuxCsslMemory_Set.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/mcuxCsslMemory_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_AssemblyMacros.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_Compare.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_Compare_arm_asm.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_CompareRev_arm_asm.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_Copy_arm_asm.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_Copy_asm.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_CopyRev_arm_asm.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_SecureSet.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_Set.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/mcuxCsslMemory_Internal_XOR.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClMemory/inc/internal/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslMemory/inc/internal/"/>
      </files>
    </component>
