vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA256_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_random" Cversion="1.0.0" condition="component.sgi_pkc.random.condition_id">
      <description>Component sgi_pkc.random</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_DRBG.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_PRNG.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_MemoryConsumption.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandom/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClRandom/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_random_modes" Cversion="1.0.0" condition="component.sgi_pkc.random_modes.condition_id">
      <description>Component sgi_pkc.random_modes</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_PrDisabled.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_Sgi.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_ExitGates.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_NormalMode.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PatchMode.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PrDisabled.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_TestMode.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRandomModes/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_PatchMode.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_TestMode.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Internal_SizeDefinitions.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_Drbg.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_ExitGates.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_NormalMode.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PatchMode.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PrDisabled.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_TestMode.h" projectpath="component/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_resource" Cversion="1.0.0" condition="component.sgi_pkc.resource.condition_id">
      <description>Component sgi_pkc.resource</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClResource/src/mcuxClResource.c" projectpath="component/sgi_pkc/src/comps/mcuxClResource/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClResource/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClResource/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClResource/inc/mcuxClResource.h" projectpath="component/sgi_pkc/src/comps/mcuxClResource/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClResource/inc/mcuxClResource_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClResource/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClResource/inc/mcuxClResource_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClResource/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClResource/inc/internal/mcuxClResource_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClResource/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClResource/inc/internal/mcuxClResource_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClResource/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClResource/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClResource/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_rsa" Cversion="1.0.0" condition="component.sgi_pkc.rsa.condition_id">
      <description>Component sgi_pkc.rsa</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ComputeD.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ComputeD_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_GenerateProbablePrime.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_getMillerRabinTestIterations.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyGeneration_GenerateKeyPair.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyLoadStore.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyTypes.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Mgf1.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_MillerRabinTest.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_MillerRabinTest_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ModeConstructors.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ModInv.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ModInv_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Pkcs1v15Encode_sign.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Pkcs1v15Verify.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivateCrt.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivateCrt_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivatePlain.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PssEncode.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PssVerify.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Public.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PublicExp.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_RemoveBlinding.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_RemoveBlinding_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPQDistance.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPQDistance_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPrimeCandidate.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPrimeCandidate_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_KeyGeneration_Crt.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_KeyGeneration_Crt_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_KeyGeneration_Helper.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_KeyGeneration_Plain.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_KeyGeneration_Plain_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_Sign.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_Verify.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_VerifyE.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClRsa/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_ComputeD_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_KeyTypes.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_MillerRabinTest_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_ModeConstructors.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_ModInv_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_PrivateCrt_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_RemoveBlinding_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_TestPQDistance_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_TestPrimeCandidate_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Util_KeyGeneration_Crt_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Util_KeyGeneration_Plain_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_ComputeD_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Macros.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_MemoryConsumption.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_PkcDefs.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_PkcTypes.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_MillerRabinTest_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_ModInv_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_PrivateCrt_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_RemoveBlinding_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_TestPQDistance_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_TestPrimeCandidate_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Util_KeyGeneration_Crt_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Util_KeyGeneration_Plain_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClRsa/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter" Cversion="1.0.0" condition="component.sgi_pkc.secure_counter.condition_id">
      <description>Component sgi_pkc secure_counter</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_AssemblyMacros.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_Cfg.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_Impl.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_None.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_SW_Local.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslSecureCounter/inc/"/>
      </files>
    </component>
